Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/svd/PIC32CM2532JH01064.svd
            <register>
               <name>CHINTENCLR</name>
               <description>Channel Interrupt Enable Clear</description>
               <addressOffset>0x4C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>TERR</name>
                     <description>Channel Transfer Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Channel Transfer Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHINTENSET</name>
               <description>Channel Interrupt Enable Set</description>
               <addressOffset>0x4D</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>TERR</name>
                     <description>Channel Transfer Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Channel Transfer Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHINTFLAG</name>
               <description>Channel Interrupt Flag Status and Clear</description>
               <addressOffset>0x4E</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>TERR</name>
                     <description>Channel Transfer Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Channel Transfer Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHSTATUS</name>
               <description>Channel Status</description>
               <addressOffset>0x4F</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PEND</name>
                     <description>Channel Pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Channel Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Channel Fetch Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DSU</name>
         <version>U22093.0.0</version>
         <description>Device Service Unit</description>
         <groupName>DSU</groupName>
         <prependToName>DSU_</prependToName>
         <baseAddress>0x41002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRC</name>
                     <description>32-bit Cyclic Redundancy Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CE</name>
                     <description>Chip-Erase</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status A</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Done</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSTEXT</name>
                     <description>CPU Reset Phase Extension</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAIL</name>
                     <description>Failure</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERR</name>
                     <description>Protection Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Status B</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PROT</name>
                     <description>Protected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGPRES</name>
                     <description>Debugger Present</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCCD0</name>
                     <description>Debug Communication Channel 0 Dirty</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCCD1</name>
                     <description>Debug Communication Channel 1 Dirty</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPE</name>
                     <description>Hot-Plugging Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEHL</name>
                     <description>Chip Erase Hard Lock</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AMOD</name>
                     <description>Access Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LENGTH</name>
               <description>Length</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LENGTH</name>
                     <description>Length</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <description>Data</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>DCC[%s]</name>
               <description>Debug Communication Channel n</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DID</name>
               <description>Device Identification</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x11060005</resetValue>
               <fields>
                  <field>
                     <name>DEVSEL</name>
                     <description>Device Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>DEVSELSelect</name>
                        <enumeratedValue>
                           <name>512KB_64KB_100PIN_CAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 100-pin / CAN</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_64PIN_CAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 64-pin / CAN</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_48PIN_CAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 48-pin / CAN</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_32PIN_CAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 32-pin / CAN</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_100PIN_CAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 100-pin / CAN</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_64PIN_CAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 64-pin / CAN</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_48PIN_CAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 48-pin / CAN</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_32PIN_CAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 32-pin / CAN</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_100PIN_NOCAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 100-pin / No CAN</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_100PIN_NOCAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 100-pin / No CAN</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_64PIN_NOCAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 64-pin / No CAN</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_64PIN_NOCAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 64-pin / No CAN</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_48PIN_NOCAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 48-pin / No CAN</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_48PIN_NOCAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 48-pin / No CAN</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512KB_64KB_32PIN_NOCAN</name>
                           <description>512 KB Flash / 64 KB SRAM / 32-pin / No CAN</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256KB_32KB_32PIN_NOCAN</name>
                           <description>256 KB Flash / 32 KB SRAM / 32-pin / No CAN</description>
                           <value>0x16</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DIE</name>
                     <description>Die Number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SERIES</name>
                     <description>Series</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>SERIESSelect</name>
                        <enumeratedValue>
                           <name>JH00_JH01</name>
                           <description>PIC32CM JH00 and PIC32CM JH01</description>
                           <value>6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAMILY</name>
                     <description>Family</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>FAMILYSelect</name>
                        <enumeratedValue>
                           <name>2</name>
                           <description>5V Industrial</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PROCESSOR</name>
                     <description>Processor</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PROCESSORSelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Cortex-M0+</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY0</name>
               <description>CoreSight ROM Table Entry 0</description>
               <addressOffset>0x1000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x9F0FC002</resetValue>
               <fields>
                  <field>
                     <name>EPRES</name>
                     <description>Entry Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMT</name>
                     <description>Format</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDOFF</name>
                     <description>Address Offset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENTRY1</name>
               <description>CoreSight ROM Table Entry 1</description>
               <addressOffset>0x1004</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>END</name>
               <description>CoreSight ROM Table End</description>
               <addressOffset>0x1008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>END</name>
                     <description>End Marker</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEMTYPE</name>
               <description>CoreSight ROM Table Memory Type</description>
               <addressOffset>0x1FCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMEMP</name>
                     <description>System Memory Present</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID4</name>
               <description>Peripheral Identification 4</description>
               <addressOffset>0x1FD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JEPCC</name>
                     <description>JEP-106 Continuation Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FKBC</name>
                     <description>4KB count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID5</name>
               <description>Peripheral Identification 5</description>
               <addressOffset>0x1FD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PID6</name>
               <description>Peripheral Identification 6</description>
               <addressOffset>0x1FD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
